openfaas-test/wrk2/hotel_reservation/output_set-profile.log
Running 30s test @ http://130.127.133.219:30080
  5 threads and 5 connections
  Thread calibration: mean lat.: 3358.351ms, rate sampling interval: 11091ms
  Thread calibration: mean lat.: 3361.822ms, rate sampling interval: 10993ms
  Thread calibration: mean lat.: 3415.716ms, rate sampling interval: 11190ms
  Thread calibration: mean lat.: 3368.727ms, rate sampling interval: 11018ms
  Thread calibration: mean lat.: 3322.735ms, rate sampling interval: 11026ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.14s     3.30s   17.51s    52.78%
    Req/Sec    23.40      0.49    24.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.65s 
 75.000%   14.55s 
 90.000%   16.76s 
 99.000%   17.43s 
 99.900%   17.53s 
 99.990%   17.53s 
 99.999%   17.53s 
100.000%   17.53s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5840.895     0.000000            4         1.00
    7761.919     0.100000          252         1.11
    8445.951     0.200000          504         1.25
   10264.575     0.300000          755         1.43
   10985.471     0.400000         1006         1.67
   11649.023     0.500000         1264         2.00
   13180.927     0.550000         1389         2.22
   13541.375     0.600000         1515         2.50
   13893.631     0.650000         1641         2.86
   14180.351     0.700000         1761         3.33
   14548.991     0.750000         1886         4.00
   15212.543     0.775000         1949         4.44
   16113.663     0.800000         2012         5.00
   16277.503     0.825000         2076         5.71
   16433.151     0.850000         2139         6.67
   16613.375     0.875000         2205         8.00
   16678.911     0.887500         2232         8.89
   16760.831     0.900000         2267        10.00
   16842.751     0.912500         2297        11.43
   16941.055     0.925000         2331        13.33
   17022.975     0.937500         2358        16.00
   17072.127     0.943750         2375        17.78
   17121.279     0.950000         2394        20.00
   17154.047     0.956250         2405        22.86
   17203.199     0.962500         2420        26.67
   17268.735     0.968750         2442        32.00
   17285.119     0.971875         2448        35.56
   17301.503     0.975000         2455        40.00
   17334.271     0.978125         2466        45.71
   17350.655     0.981250         2470        53.33
   17383.423     0.984375         2481        64.00
   17383.423     0.985938         2481        71.11
   17399.807     0.987500         2486        80.00
   17432.575     0.989062         2499        91.43
   17432.575     0.990625         2499       106.67
   17432.575     0.992188         2499       128.00
   17432.575     0.992969         2499       142.22
   17432.575     0.993750         2499       160.00
   17481.727     0.994531         2506       182.86
   17481.727     0.995313         2506       213.33
   17481.727     0.996094         2506       256.00
   17481.727     0.996484         2506       284.44
   17498.111     0.996875         2508       320.00
   17498.111     0.997266         2508       365.71
   17530.879     0.997656         2514       426.67
   17530.879     1.000000         2514          inf
#[Mean    =    12137.295, StdDeviation   =     3303.400]
#[Max     =    17514.496, Total count    =         2514]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   17.10ms
 75.000%   61.02ms
 90.000%   92.61ms
 99.000%  194.82ms
 99.900%  198.01ms
 99.990%  200.45ms
 99.999%  200.45ms
100.000%  200.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.719     0.000000            1         1.00
      13.367     0.100000          252         1.11
      14.735     0.200000          503         1.25
      15.567     0.300000          756         1.43
      16.239     0.400000         1006         1.67
      17.103     0.500000         1262         2.00
      17.807     0.550000         1383         2.22
      19.599     0.600000         1509         2.50
      49.663     0.650000         1635         2.86
      54.623     0.700000         1760         3.33
      61.023     0.750000         1886         4.00
      62.591     0.775000         1951         4.44
      63.935     0.800000         2014         5.00
      65.119     0.825000         2075         5.71
      67.007     0.850000         2137         6.67
      70.335     0.875000         2200         8.00
      78.783     0.887500         2233         8.89
      92.607     0.900000         2263        10.00
      96.383     0.912500         2295        11.43
      97.087     0.925000         2326        13.33
      97.791     0.937500         2357        16.00
      98.047     0.943750         2375        17.78
      98.303     0.950000         2389        20.00
      98.623     0.956250         2406        22.86
      98.943     0.962500         2420        26.67
      99.583     0.968750         2437        32.00
      99.967     0.971875         2444        35.56
     100.543     0.975000         2452        40.00
     101.375     0.978125         2460        45.71
     102.911     0.981250         2467        53.33
     189.183     0.984375         2475        64.00
     192.511     0.985938         2479        71.11
     194.303     0.987500         2486        80.00
     194.431     0.989062         2487        91.43
     194.943     0.990625         2491       106.67
     195.455     0.992188         2495       128.00
     195.711     0.992969         2497       142.22
     195.967     0.993750         2499       160.00
     196.223     0.994531         2502       182.86
     196.607     0.995313         2503       213.33
     196.735     0.996094         2505       256.00
     197.119     0.996484         2506       284.44
     197.375     0.996875         2507       320.00
     197.503     0.997266         2508       365.71
     197.631     0.997656         2509       426.67
     197.759     0.998047         2510       512.00
     197.759     0.998242         2510       568.89
     198.015     0.998437         2511       640.00
     198.015     0.998633         2511       731.43
     198.911     0.998828         2512       853.33
     198.911     0.999023         2512      1024.00
     198.911     0.999121         2512      1137.78
     199.679     0.999219         2513      1280.00
     199.679     0.999316         2513      1462.86
     199.679     0.999414         2513      1706.67
     199.679     0.999512         2513      2048.00
     199.679     0.999561         2513      2275.56
     200.447     0.999609         2514      2560.00
     200.447     1.000000         2514          inf
#[Mean    =       38.120, StdDeviation   =       34.632]
#[Max     =      200.320, Total count    =         2514]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3760 requests in 30.01s, 4.45MB read
Requests/sec:    125.31
Transfer/sec:    151.86KB